tutorials/impHybridPorousInterFoam/capillary-rise/0/UnonWetting
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UnonWetting;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    topPorous
    {
        type            zeroGradient;
    }
    bottomPorous
    {
        type            zeroGradient;
    }
    left
    {
        type            noSlip; 
    }
    right
    {
        type            noSlip; 
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
