tutorials/impHybridPorousInterFoam/capillary-rise/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
       type            fixedValue;
       value           uniform 0.0;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    topPorous
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    bottomPorous
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    left
    {
        type            fixedFluxPressure;
    }
    right
    {
        type            fixedFluxPressure;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
