tutorials/impHybridPorousInterFoam/capillary-rise/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


phases (wetting nonWetting);

nonWetting 
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.48e-5;
    rho             [1 -3 0 0 0 0 0] 1;   
}

wetting
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-6; 
    rho             [1 -3 0 0 0 0 0] 1000;
}

sigma            [1 0 -2 0 0 0 0]  0.07; 

activateCapillarity            0;
activatePorousContactAngle     1;
theta0                         45;
Mifc                           0;

alpha.wettingmin           alpha.wettingmin [0  0  0 0 0 0 0] 0;
alpha.wettingmax           alpha.wettingmax [0  0  0 0 0 0 0] 0.999;

/*
relativePermeabilityModel  VanGenuchten;
capillarityModel           VanGenuchten;

VanGenuchtenCoeffs
{
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 100;
    m 3;
}
*/

relativePermeabilityModel  BrooksAndCorey;
capillarityModel           BrooksAndCorey;

BrooksAndCoreyCoeffs
{
    n 3;
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 100;
    alpha 0.5;	
}
